#include <stdlib.h>
#include <string.h>
#include <stdio.h>

// 功能：佛祖保佑 永无BUG
// 警告：不要删！！！否则程序会崩溃！！！
void budda_bless() {
    printf(
"                        _oo0oo_                       \n"
"                       088888880                      \n"
"                       88\" . \"88                    \n"
"                       (| -_- |)                      \n"
"                       0\\  =  /0                     \n"
"                     ___/`---'\\___                   \n"
"                   .' \\\\|     |// '.                \n"
"                  / \\\\|||  :  |||// \\              \n"
"                 / _||||| -:- |||||_ \\               \n"
"                |   | \\\\\\  -  /// |   |            \n"
"                | \\_|  ''\\---/''  |_/ |             \n"
"                \\  .-\\__  '-'  ___/-. /             \n"
"              ___'. .'  /--.--\\  `. .'___            \n"
"           .\"\" '<  `.___\\_<|>_/___.' >' \"\".      \n"
"          | | :  `- \\`.;`\\ _ /`;.`/ - ` : | |       \n"
"          \\  \\ `_.   \\_ __\\ /__ _/   .-` /  /     \n"
"      =====`-.____`.___ \\_____/___.-`___.-'=====     \n"
"                        `=---='                       \n"
"                                                      \n"
"~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~ \n"
"                                                      \n"
"                苦提本无树   明镜亦非台               \n"
"                本来无BUG    何必常修改               \n"
"                                                      \n"
    );
}

void fool() {
    int array[10];
    memset(array, 1, sizeof(array));
}

void bar() {
    int idx;
    char *buf = (char *)malloc(1);
    buf[idx] = 'A';
}

int main() {
    fool();
    budda_bless();  // 为了保证程序正常运行，这里请佛祖做开光处理！
    bar();
    return 0;
}